GT2/RANS/KEpsilon_LamBremhorst_lowRE/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{
    inlet
    {
	//This will give wrong results
        //type            fixedValue;
        //value           $internalField;

	//This is ok
        type            zeroGradient;
    }
    top
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    slipsurface
    {
        //type            zeroGradient;
        type            slip;
    }
    bottom
    {
        type            zeroGradient;

        //type            epsilonWallFunction;
        //value           $internalField;		//bc2-bc3
        //value           uniform 1e-8;			//bc1

//bc4
        //type            fixedValue;
        //value           uniform 1e-8;
        //value           uniform 10000000;	//bc5	1000
        //value           $internalField;	
    }

    frontandback
    {
	type	empty;
    }
}

// ************************************************************************* //
